import { Advertisement } from "../model/types";
import ad1 from "@/public/assets/ad1.png";
import ad2 from "@/public/assets/ad2.png";
import ad3 from "@/public/assets/ad3.png";
import ad4 from "@/public/assets/ad4.png";

export const ads: Advertisement[] = [
  {
    id: 1,
    title: "Заголовок объявления из нескольких слов",
    textContent:
      "Искусственный интеллект - это не одна дисциплина, как думают многие, а совокупность различных между собой направлений. Здесь можно добавить больше текста для демонстрации...",
    date: "21 мая 2021",
    img: ad1,
  },
  {
    id: 2,
    title: "Заголовок объявления из нескольких слов",
    textContent:
      "Искусственный интеллект - это не одна дисциплина, как думают многие, а совокупность различных между собой направлений. Здесь можно добавить больше текста для демонстрации...",
    date: "24 мая 2021",
    img: ad2,
  },
  {
    id: 3,
    title: "Заголовок объявления из нескольких слов",
    textContent:
      "Искусственный интеллект - это не одна дисциплина, как думают многие, а совокупность различных между собой направлений. Здесь можно добавить больше текста для демонстрации...",
    date: "21 мая 2021",
    img: ad3,
  },
  {
    id: 4,
    title: "Заголовок объявления из нескольких слов",
    textContent:
      "Искусственный интеллект - это не одна дисциплина, как думают многие, а совокупность различных между собой направлений. Здесь можно добавить больше текста для демонстрации...",
    date: "21 мая 2021",
    img: ad4,
  },
];
